backend/app/controllers/api/v1/blocks_productions_controller.rb

SELECT "blocks_productions".* FROM "blocks_productions" WHERE (created_at >= '2026-01-21 18:50:24.512942') ORDER BY "blocks_productions"."created_at" DESC
---
      def index
        productions = BlocksProduction.order(created_at: :desc)

        case params[:period]
        when 'week'
          productions = productions.where('created_at >= ?', 1.week.ago)
        when 'month'
          productions = productions.where('created_at >= ?', 1.month.ago)

INSERT INTO "blocks_productions" ("block_size", "block_type", "blocks_produced", "cement_bags", "dust_trips", "dust_cost", "manufacturing_pay", "water_cost", "electricity_cost", "blocks_sold", "amount_sold", "created_at", "updated_at") VALUES ('6in', 'solid', 200, 10, 1, 3000.0, 300.0, NULL, NULL, NULL, NULL, '2026-01-28 19:01:26.686052', '2026-01-28 19:01:26.686052') RETURNING "id"
---
      def create
        production = BlocksProduction.new(blocks_production_params)

        if production.save