backend/app/controllers/api/v1/loader_rentals_controller.rb

SELECT "loader_rentals".* FROM "loader_rentals" WHERE (created_at >= '2026-01-21 17:35:23.281340') ORDER BY "loader_rentals"."created_at" DESC
---
      def index
        rentals = LoaderRental.order(created_at: :desc)

        case params[:period]
        when 'week'
          rentals = rentals.where('created_at >= ?', 1.week.ago)
        when 'month'
          rentals = rentals.where('created_at >= ?', 1.month.ago)

INSERT INTO "loader_rentals" ("work_type", "price_charged", "client_name", "client_contact", "created_at", "updated_at") VALUES ('full_day', 8000.0, 'Mr KK Fosu', '0240000113', '2026-01-28 17:36:11.918685', '2026-01-28 17:36:11.918685') RETURNING "id"
---
      def create
        rental = LoaderRental.new(loader_rental_params)

        if rental.save