backend/app/controllers/api/v1/loader_expenditures_controller.rb

SELECT "loader_expenditures".* FROM "loader_expenditures" WHERE (created_at >= '2026-01-21 17:54:02.079261') ORDER BY "loader_expenditures"."created_at" DESC
---
      def index
        expenditures = LoaderExpenditure.order(created_at: :desc)

        case params[:period]
        when 'week'
          expenditures = expenditures.where('created_at >= ?', 1.week.ago)
        when 'month'
          expenditures = expenditures.where('created_at >= ?', 1.month.ago)

INSERT INTO "loader_expenditures" ("fuel", "washing", "greasing", "chop_money", "created_at", "updated_at") VALUES (2300.0, 150.0, 70.0, 500.0, '2026-01-28 17:54:25.685718', '2026-01-28 17:54:25.685718') RETURNING "id"
---
      def create
        expenditure = LoaderExpenditure.new(loader_expenditure_params)

        if expenditure.save