backend/app/controllers/api/v1/registrations_controller.rb

        def create
          # accept both canonical keys (full_name, phone_number) and legacy (name, phone)
          user_params = params.require(:user).permit(
            :email,
            :password,
            :password_confirmation,
            :role,
            :full_name,
            :phone_number,
            :name,
            :phone
          )

          # Normalize legacy keys
          full_name = user_params.delete(:full_name) || user_params.delete(:name)
          phone_number = user_params.delete(:phone_number) || user_params.delete(:phone)

          resource = User.new(user_params.to_h.merge({ full_name: full_name, phone_number: phone_number }))

          if resource.save
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "role", "full_name", "phone_number") VALUES ('test_blocks_admin@gmail.com', '$2a$12$y5aApfv3TVHJKHWF8A.FVObtOkznpA9nbk5UlmoXXUd.OltIX7/PO', NULL, NULL, NULL, '2026-01-28 01:35:12.324198', '2026-01-28 01:35:12.324198', 'blocks_admin', 'Kofi Annan', '0551234987') RETURNING "id"