backend/app/controllers/api/v1/sessions_controller.rb

      def create
        # extract credentials from JSON payload (params may include nested keys in tests)
        email = params.dig(:user, :email) || params.dig(:session, :user, :email)
        password = params.dig(:user, :password) || params.dig(:session, :user, :password)

        user = User.find_for_database_authentication(email: email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'user1@example.com' ORDER BY "users"."id" ASC LIMIT 1