backend/app/controllers/api/v1/survey_rentals_controller.rb

      def index
        rentals = SurveyRental.order(created_at: :desc)

        case params[:period]
        when 'week'
          rentals = rentals.where('created_at >= ?', 1.week.ago)
        when 'month'
          rentals = rentals.where('created_at >= ?', 1.month.ago)
---
SELECT "survey_rentals".* FROM "survey_rentals" WHERE (created_at >= '2026-01-21 18:26:24.155910') ORDER BY "survey_rentals"."created_at" DESC

      def create
        rental = SurveyRental.new(survey_rental_params)

        if rental.save
---
INSERT INTO "survey_rentals" ("machine_color", "last_four_digits", "rentee_name", "took_stick", "points", "created_at", "updated_at") VALUES ('Yellow', '0034', 'Kofi Ansah', TRUE, NULL, '2026-01-28 18:26:54.615765', '2026-01-28 18:26:54.615765') RETURNING "id"

      def update
        rental = SurveyRental.find(params[:id])

        if rental.update(update_params)
---
SELECT "survey_rentals".* FROM "survey_rentals" WHERE "survey_rentals"."id" = 1 LIMIT 1
UPDATE "survey_rentals" SET "points" = 4, "updated_at" = '2026-01-28 18:30:30.030230' WHERE "survey_rentals"."id" = 1